run/multiRegionDuineveldRisingBubble/baseMeshes/meshB/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//- The total number of domains (mandatory)
numberOfSubdomains	 4;

method manual;

simpleCoeffs
{
    n		(1 3 1);
    delta	0.001;
}


metisCoeffs
{
    processorWeights
    (
	8
	1
	1
    );
}

manualCoeffs
{
	dataFile   "cellDecomposition2";
}

// ************************************************************************* //
